MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamrh71/thirdparty/atsamrh71/component/xdmac.h
#define   XDMAC_CC_PERID_TC2_Val              _U_(0x1A)                                            /**< (XDMAC_CC) TC2  */
#define   XDMAC_CC_PERID_TC3_Val              _U_(0x1B)                                            /**< (XDMAC_CC) TC3  */
#define   XDMAC_CC_PERID_SHA_Val              _U_(0x1C)                                            /**< (XDMAC_CC) SHA  */
#define   XDMAC_CC_PERID_TC1_CPA_Val          _U_(0x1D)                                            /**< (XDMAC_CC) TC1_CPA  */
#define   XDMAC_CC_PERID_TC4_CPA_Val          _U_(0x1E)                                            /**< (XDMAC_CC) TC4_CPA  */
#define   XDMAC_CC_PERID_TC7_CPA_Val          _U_(0x1F)                                            /**< (XDMAC_CC) TC7_CPA  */
#define   XDMAC_CC_PERID_TC10_CPA_Val         _U_(0x20)                                            /**< (XDMAC_CC) TC10_CPA  */
#define   XDMAC_CC_PERID_TC1_CPB_Val          _U_(0x21)                                            /**< (XDMAC_CC) TC1_CPB  */
#define   XDMAC_CC_PERID_TC4_CPB_Val          _U_(0x22)                                            /**< (XDMAC_CC) TC4_CPB  */
#define   XDMAC_CC_PERID_TC7_CPB_Val          _U_(0x23)                                            /**< (XDMAC_CC) TC7_CPB  */
#define   XDMAC_CC_PERID_TC10_CPB_Val         _U_(0x24)                                            /**< (XDMAC_CC) TC10_CPB  */
#define   XDMAC_CC_PERID_TC1_CPC_Val          _U_(0x25)                                            /**< (XDMAC_CC) TC1_CPC  */
#define   XDMAC_CC_PERID_TC4_CPC_Val          _U_(0x26)                                            /**< (XDMAC_CC) TC4_CPC  */
#define   XDMAC_CC_PERID_TC7_CPC_Val          _U_(0x27)                                            /**< (XDMAC_CC) TC7_CPC  */
#define   XDMAC_CC_PERID_TC10_CPC_Val         _U_(0x28)                                            /**< (XDMAC_CC) TC10_CPC  */
#define   XDMAC_CC_PERID_TC1_ETRG_Val         _U_(0x29)                                            /**< (XDMAC_CC) TC1_ETRG  */
#define   XDMAC_CC_PERID_TC4_ETRG_Val         _U_(0x2A)                                            /**< (XDMAC_CC) TC4_ETRG  */
#define   XDMAC_CC_PERID_TC7_ETRG_Val         _U_(0x2B)                                            /**< (XDMAC_CC) TC7_ETRG  */
#define   XDMAC_CC_PERID_TC10_ETRG_Val        _U_(0x2C)                                            /**< (XDMAC_CC) TC10_ETRG  */
#define XDMAC_CC_PERID_FLEXCOM0_TX            (XDMAC_CC_PERID_FLEXCOM0_TX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM0_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM0_RX            (XDMAC_CC_PERID_FLEXCOM0_RX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM0_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM1_TX            (XDMAC_CC_PERID_FLEXCOM1_TX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM1_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM1_RX            (XDMAC_CC_PERID_FLEXCOM1_RX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM1_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM2_TX            (XDMAC_CC_PERID_FLEXCOM2_TX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM2_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM2_RX            (XDMAC_CC_PERID_FLEXCOM2_RX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM2_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM3_TX            (XDMAC_CC_PERID_FLEXCOM3_TX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM3_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM3_RX            (XDMAC_CC_PERID_FLEXCOM3_RX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM3_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM4_TX            (XDMAC_CC_PERID_FLEXCOM4_TX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM4_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM4_RX            (XDMAC_CC_PERID_FLEXCOM4_RX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM4_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM5_TX            (XDMAC_CC_PERID_FLEXCOM5_TX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM5_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM5_RX            (XDMAC_CC_PERID_FLEXCOM5_RX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM5_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM6_TX            (XDMAC_CC_PERID_FLEXCOM6_TX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM6_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM6_RX            (XDMAC_CC_PERID_FLEXCOM6_RX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM6_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM7_TX            (XDMAC_CC_PERID_FLEXCOM7_TX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM7_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM7_RX            (XDMAC_CC_PERID_FLEXCOM7_RX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM7_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM8_TX            (XDMAC_CC_PERID_FLEXCOM8_TX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM8_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM8_RX            (XDMAC_CC_PERID_FLEXCOM8_RX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM8_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM9_TX            (XDMAC_CC_PERID_FLEXCOM9_TX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM9_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM9_RX            (XDMAC_CC_PERID_FLEXCOM9_RX_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) FLEXCOM9_RX Position  */
#define XDMAC_CC_PERID_QSPI_TX                (XDMAC_CC_PERID_QSPI_TX_Val << XDMAC_CC_PERID_Pos)   /**< (XDMAC_CC) QSPI_TX Position  */
#define XDMAC_CC_PERID_QSPI_RX                (XDMAC_CC_PERID_QSPI_RX_Val << XDMAC_CC_PERID_Pos)   /**< (XDMAC_CC) QSPI_RX Position  */
#define XDMAC_CC_PERID_PWM0                   (XDMAC_CC_PERID_PWM0_Val << XDMAC_CC_PERID_Pos)      /**< (XDMAC_CC) PWM0 Position  */
#define XDMAC_CC_PERID_PWM1                   (XDMAC_CC_PERID_PWM1_Val << XDMAC_CC_PERID_Pos)      /**< (XDMAC_CC) PWM1 Position  */
#define XDMAC_CC_PERID_TC0                    (XDMAC_CC_PERID_TC0_Val << XDMAC_CC_PERID_Pos)       /**< (XDMAC_CC) TC0 Position  */
#define XDMAC_CC_PERID_TC1                    (XDMAC_CC_PERID_TC1_Val << XDMAC_CC_PERID_Pos)       /**< (XDMAC_CC) TC1 Position  */
#define XDMAC_CC_PERID_TC2                    (XDMAC_CC_PERID_TC2_Val << XDMAC_CC_PERID_Pos)       /**< (XDMAC_CC) TC2 Position  */
#define XDMAC_CC_PERID_TC3                    (XDMAC_CC_PERID_TC3_Val << XDMAC_CC_PERID_Pos)       /**< (XDMAC_CC) TC3 Position  */
#define XDMAC_CC_PERID_SHA                    (XDMAC_CC_PERID_SHA_Val << XDMAC_CC_PERID_Pos)       /**< (XDMAC_CC) SHA Position  */
#define XDMAC_CC_PERID_TC1_CPA                (XDMAC_CC_PERID_TC1_CPA_Val << XDMAC_CC_PERID_Pos)   /**< (XDMAC_CC) TC1_CPA Position  */
#define XDMAC_CC_PERID_TC4_CPA                (XDMAC_CC_PERID_TC4_CPA_Val << XDMAC_CC_PERID_Pos)   /**< (XDMAC_CC) TC4_CPA Position  */
#define XDMAC_CC_PERID_TC7_CPA                (XDMAC_CC_PERID_TC7_CPA_Val << XDMAC_CC_PERID_Pos)   /**< (XDMAC_CC) TC7_CPA Position  */
#define XDMAC_CC_PERID_TC10_CPA               (XDMAC_CC_PERID_TC10_CPA_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TC10_CPA Position  */
#define XDMAC_CC_PERID_TC1_CPB                (XDMAC_CC_PERID_TC1_CPB_Val << XDMAC_CC_PERID_Pos)   /**< (XDMAC_CC) TC1_CPB Position  */
#define XDMAC_CC_PERID_TC4_CPB                (XDMAC_CC_PERID_TC4_CPB_Val << XDMAC_CC_PERID_Pos)   /**< (XDMAC_CC) TC4_CPB Position  */
#define XDMAC_CC_PERID_TC7_CPB                (XDMAC_CC_PERID_TC7_CPB_Val << XDMAC_CC_PERID_Pos)   /**< (XDMAC_CC) TC7_CPB Position  */
#define XDMAC_CC_PERID_TC10_CPB               (XDMAC_CC_PERID_TC10_CPB_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TC10_CPB Position  */
#define XDMAC_CC_PERID_TC1_CPC                (XDMAC_CC_PERID_TC1_CPC_Val << XDMAC_CC_PERID_Pos)   /**< (XDMAC_CC) TC1_CPC Position  */
#define XDMAC_CC_PERID_TC4_CPC                (XDMAC_CC_PERID_TC4_CPC_Val << XDMAC_CC_PERID_Pos)   /**< (XDMAC_CC) TC4_CPC Position  */
#define XDMAC_CC_PERID_TC7_CPC                (XDMAC_CC_PERID_TC7_CPC_Val << XDMAC_CC_PERID_Pos)   /**< (XDMAC_CC) TC7_CPC Position  */
#define XDMAC_CC_PERID_TC10_CPC               (XDMAC_CC_PERID_TC10_CPC_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TC10_CPC Position  */
#define XDMAC_CC_PERID_TC1_ETRG               (XDMAC_CC_PERID_TC1_ETRG_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TC1_ETRG Position  */
#define XDMAC_CC_PERID_TC4_ETRG               (XDMAC_CC_PERID_TC4_ETRG_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TC4_ETRG Position  */
#define XDMAC_CC_PERID_TC7_ETRG               (XDMAC_CC_PERID_TC7_ETRG_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TC7_ETRG Position  */
#define XDMAC_CC_PERID_TC10_ETRG              (XDMAC_CC_PERID_TC10_ETRG_Val << XDMAC_CC_PERID_Pos) /**< (XDMAC_CC) TC10_ETRG Position  */
#define XDMAC_CC_Msk                          _U_(0x7FEF7FF7)                                      /**< (XDMAC_CC) Register Mask  */


/* -------- XDMAC_CDS_MSP : (XDMAC Offset: 0x2C) (R/W 32) Channel Data Stride Memory Set Pattern -------- */
#define XDMAC_CDS_MSP_SDS_MSP_Pos             _U_(0)                                               /**< (XDMAC_CDS_MSP) Channel x Source Data stride or Memory Set Pattern Position */
#define XDMAC_CDS_MSP_SDS_MSP_Msk             (_U_(0xFFFF) << XDMAC_CDS_MSP_SDS_MSP_Pos)           /**< (XDMAC_CDS_MSP) Channel x Source Data stride or Memory Set Pattern Mask */
#define XDMAC_CDS_MSP_SDS_MSP(value)          (XDMAC_CDS_MSP_SDS_MSP_Msk & ((value) << XDMAC_CDS_MSP_SDS_MSP_Pos))
#define XDMAC_CDS_MSP_DDS_MSP_Pos             _U_(16)                                              /**< (XDMAC_CDS_MSP) Channel x Destination Data Stride or Memory Set Pattern Position */
#define XDMAC_CDS_MSP_DDS_MSP_Msk             (_U_(0xFFFF) << XDMAC_CDS_MSP_DDS_MSP_Pos)           /**< (XDMAC_CDS_MSP) Channel x Destination Data Stride or Memory Set Pattern Mask */
#define XDMAC_CDS_MSP_DDS_MSP(value)          (XDMAC_CDS_MSP_DDS_MSP_Msk & ((value) << XDMAC_CDS_MSP_DDS_MSP_Pos))
#define XDMAC_CDS_MSP_Msk                     _U_(0xFFFFFFFF)                                      /**< (XDMAC_CDS_MSP) Register Mask  */


/* -------- XDMAC_CSUS : (XDMAC Offset: 0x30) (R/W 32) Channel Source Microblock Stride -------- */
#define XDMAC_CSUS_SUBS_Pos                   _U_(0)                                               /**< (XDMAC_CSUS) Channel x Source Microblock Stride Position */
#define XDMAC_CSUS_SUBS_Msk                   (_U_(0xFFFFFF) << XDMAC_CSUS_SUBS_Pos)               /**< (XDMAC_CSUS) Channel x Source Microblock Stride Mask */
#define XDMAC_CSUS_SUBS(value)                (XDMAC_CSUS_SUBS_Msk & ((value) << XDMAC_CSUS_SUBS_Pos))
#define XDMAC_CSUS_Msk                        _U_(0x00FFFFFF)                                      /**< (XDMAC_CSUS) Register Mask  */


